cases/transISTDroplet2D/system/controlDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     leiaSemiLagrangianLevelSetTwoPhaseFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         @!END_TIME!@;

// Fixed time step generated by workflow/scripts/materialize.py.
//   mode=@!TIME_STEP_CONTROL!@
//   target advective Co=@!TARGET_ADVECTIVE_CO!@
//   reference domain length=@!DOMAIN_LENGTH!@ m
//   reference speed=@!REFERENCE_SPEED!@ m/s
// Coupled capillary cases use dt~h^1.5. Sigma=0 kinematic cases may instead
// request dt=Co*h/U so spatial refinement keeps the advective Co fixed.
deltaT          @!MAX_DELTA_T!@;

writeControl    runTime;
writeInterval   @!WRITE_INTERVAL!@;

purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   8;

runTimeModifiable no;

// In capillary mode, explicit surface tension is the binding stability limit
//   dt_sigma = sqrt((rho1+rho2) dx^3 / (2 pi sigma)) ~ 2.6e-4 s at 32^2.
// The parasitic-current feedback is only STABLE well below dt_sigma; deltaT above
// is fixed to MAX_DELTA_T = CAPILLARY_DT_COEFF / N_CELLS^1.5 (coeff =
// @!CAPILLARY_DT_COEFF!@ s, calibrated so dt(N=32) ~ dt_sigma/4; scales dt ~ dx^1.5).
// adjustTimeStep remains off in both modes: maxCo/maxAlphaCo/maxDeltaT are
// required by solver construction but inert because deltaT is fixed explicitly.
adjustTimeStep  no;
maxCo           @!MAX_CO!@;
maxAlphaCo      @!MAX_CO!@;
maxDeltaT       @!MAX_DELTA_T!@;

// Parasitic-current metrics (max|U|, mean|U|) + the Laplace jump are written every
// step to leiaSemiLagrangianLevelSetTwoPhaseFoam.csv by the solver (probe-free,
// mesh-robust); that CSV is what the study aggregates. No function objects needed.

// ************************************************************************* //
